Revit 2027 API
ParameterTypeId.ViewSolarstudyShadowsIntensityValue Property
 "Shadows intensity"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyShadowsIntensityValue { get; }
Public Shared ReadOnly Property ViewSolarstudyShadowsIntensityValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyShadowsIntensityValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyShadowsIntensityValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace